{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "\n": 5,
      " ": 6,
      "-": 7,
      ".": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      "B": 19,
      "C": 20,
      "_": 21,
      "a": 22,
      "b": 23,
      "c": 24,
      "d": 25,
      "e": 26,
      "f": 27,
      "g": 28,
      "h": 29,
      "i": 30,
      "l": 31,
      "m": 32,
      "n": 33,
      "o": 34,
      "p": 35,
      "r": 36,
      "s": 37,
      "t": 38,
      "u": 39,
      "v": 40,
      "w": 41,
      "x": 42,
      "y": 43,
      "z": 44,
      "0.": 45,
      " 0.": 46,
      "00": 47,
      "-0.": 48,
      "3 ": 49,
      " -0.": 50,
      "0000": 51,
      " 1": 52,
      " 0.1": 53,
      " 0.0": 54,
      "99": 55,
      "01": 56,
      "000000": 57,
      "3 1": 58,
      "22": 59,
      "21": 60,
      " 0.000000": 61,
      "03": 62,
      "23": 63,
      "24": 64,
      "25": 65,
      "26": 66,
      "04": 67,
      "27": 68,
      "86": 69,
      "87": 70,
      "81": 71,
      "85": 72,
      "84": 73,
      "05": 74,
      "97": 75,
      "95": 76,
      "07": 77,
      "96": 78,
      "91": 79,
      "06": 80,
      "83": 81,
      "94": 82,
      " 0.3": 83,
      "93": 84,
      " 0.4": 85,
      " 0.5": 86,
      " 0.7": 87,
      "61": 88,
      "67": 89,
      "65": 90,
      "64": 91,
      "31": 92,
      "34": 93,
      "37": 94,
      "35": 95,
      "20": 96,
      "88": 97,
      "47": 98,
      "41": 99,
      "51": 100,
      "57": 101,
      "98": 102,
      "28": 103,
      "66": 104,
      "9\n": 105,
      "2\n": 106,
      "44": 107,
      "90": 108,
      "71": 109,
      "55": 110,
      "36": 111,
      "11": 112,
      "77": 113,
      "45": 114,
      "08": 115,
      " 0.6": 116,
      "0\n": 117,
      "3 -0.": 118,
      "02": 119,
      "33": 120,
      " 0.00": 121,
      "9 -0.": 122,
      "92": 123,
      "8\n": 124,
      ".000000": 125,
      "-0.01": 126,
      "54": 127,
      "0.01": 128,
      " 0.000000 0.000000": 129,
      "17": 130,
      "9 ": 131,
      "3\n": 132,
      "46": 133,
      "56": 134,
      "9 0.": 135,
      " -0.1": 136,
      "38": 137,
      "0.00": 138,
      "74": 139,
      "-0.00": 140,
      "75": 141,
      "15": 142,
      "2 ": 143,
      "0 ": 144,
      "76": 145,
      "14": 146,
      "0 -0.": 147,
      "2 -0.": 148,
      " 0.2": 149,
      " 0.8": 150,
      "9 1": 151,
      " 0.99": 152,
      "16": 153,
      "9 0.1": 154,
      "8 ": 155,
      " 0.9": 156,
      "8 -0.": 157,
      "9 0.0": 158,
      "43": 159,
      "53": 160,
      "2 1": 161,
      "996": 162,
      "7\n": 163,
      "80": 164,
      "4\n": 165,
      "1\n": 166,
      "5\n": 167,
      "6\n": 168,
      "0.0": 169,
      "63": 170,
      "-0.0": 171,
      "-1": 172,
      "-1.000000": 173,
      " -0.00": 174,
      "0 1": 175,
      "73": 176,
      "48": 177,
      "2 0.": 178,
      "58": 179,
      "2 0.1": 180,
      "78": 181,
      "13": 182,
      "0 0.1": 183,
      "68": 184,
      "0.03": 185,
      " 1.000000": 186,
      "-0.03": 187,
      " -1.000000": 188,
      "0 0.": 189,
      "2 0.0": 190,
      "18": 191,
      "0 0.0": 192,
      "29": 193,
      "6 ": 194,
      "4 ": 195,
      "5 ": 196,
      " -0.99": 197,
      " 0.21": 198,
      " 0.14": 199,
      " 0.11": 200,
      "3 4": 201,
      "3 2": 202,
      "7 ": 203,
      " 0.22": 204,
      "1 ": 205,
      "3 7": 206,
      " 0.15": 207,
      "3 21": 208,
      " 0.23": 209,
      "09": 210,
      " 11": 211,
      "3 22": 212,
      " 0.07": 213,
      "3 5": 214,
      "6 -0.": 215,
      "3 3": 216,
      "5 -0.": 217,
      "3 11": 218,
      "7 -0.": 219,
      "4 -0.": 220,
      " 0.000000 -0.": 221,
      " 0.01": 222,
      "1 -0.": 223,
      "3 6": 224,
      " 0.25": 225,
      "32": 226,
      "30": 227,
      " 14": 228,
      " 0.24": 229,
      "82": 230,
      " 0.05": 231,
      " 0.17": 232,
      "9969": 233,
      " 15": 234,
      "3 14": 235,
      " 0.06": 236,
      " 0.13": 237,
      " 0.97": 238,
      " 0.27": 239,
      " 2": 240,
      " 0.96": 241,
      " 0.04": 242,
      " 0.26": 243,
      "89": 244,
      " 0.000000 0.000000 -1.000000": 245,
      "3 15": 246,
      " 0.95": 247,
      " 17": 248,
      " 0.000000 0.000000 1.000000": 249,
      " 21": 250,
      "39": 251,
      " 0.16": 252,
      "3 23": 253,
      " 22": 254,
      " 0.86": 255,
      " -0.0": 256,
      "50": 257,
      "60": 258,
      "3 17": 259,
      " 0.93": 260,
      "62": 261,
      " 0.94": 262,
      "0.04": 263,
      " 0.91": 264,
      " 13": 265,
      "52": 266,
      "40": 267,
      "70": 268,
      "69": 269,
      "8 0.1": 270,
      "72": 271,
      "3 13": 272,
      " 0.67": 273,
      " 0.03": 274,
      "-0.04": 275,
      "10": 276,
      "42": 277,
      "3 8": 278,
      " 16": 279,
      " 0.87": 280,
      "9 0.3": 281,
      "923": 282,
      "3 0.1": 283,
      " 0.08": 284,
      "87\n": 285,
      " 0.61": 286,
      " 0.65": 287,
      "85\n": 288,
      " -0.7": 289,
      "984": 290,
      "981": 291,
      "86\n": 292,
      "924": 293,
      "207": 294,
      " -0.01": 295,
      "3 16": 296,
      " 23": 297,
      "83\n": 298,
      "201": 299,
      "7 0.1": 300,
      " 0.64": 301,
      "90\n": 302,
      "0.02": 303,
      "06\n": 304,
      "95\n": 305,
      "20\n": 306,
      "922": 307,
      "905": 308,
      "987": 309,
      " 0.85": 310,
      "93\n": 311,
      "204": 312,
      " 0.84": 313,
      "6 0.1": 314,
      "26\n": 315,
      "88\n": 316,
      "03\n": 317,
      " 0.83": 318,
      "904": 319,
      "23\n": 320,
      " 0.81": 321,
      "84\n": 322,
      "5 0.1": 323,
      "021": 324,
      "96\n": 325,
      "25\n": 326,
      "97\n": 327,
      "8 0.0": 328,
      "921": 329,
      "81\n": 330,
      " -0.3": 331,
      "9 0.5": 332,
      "99\n": 333,
      "083": 334,
      "9 0.4": 335,
      "94\n": 336,
      "200": 337,
      "-0.02": 338,
      "205": 339,
      " 0.31": 340,
      "98\n": 341,
      "28\n": 342,
      "91\n": 343,
      "4 0.1": 344,
      "907": 345,
      "900": 346,
      "1 0.1": 347,
      "206": 348,
      "986": 349,
      "0.1": 350,
      "24\n": 351,
      "3 24": 352,
      "901": 353,
      "3 0.0": 354,
      " 0.37": 355,
      "22\n": 356,
      "8 1": 357,
      " -0.4": 358,
      "27\n": 359,
      "906": 360,
      "926": 361,
      "07\n": 362,
      "9 0.7": 363,
      "925": 364,
      "6 0.0": 365,
      "985": 366,
      "983": 367,
      " 0.000000 0.4": 368,
      "9 -0.00": 369,
      "21\n": 370,
      "287": 371,
      "7 0.0": 372,
      " 0.999969": 373,
      "05\n": 374,
      "04\n": 375,
      "3 25": 376,
      "027": 377,
      "01\n": 378,
      "297": 379,
      "284": 380,
      " 0.51": 381,
      " 0.57": 382,
      "00\n": 383,
      "295": 384,
      "203": 385,
      "294": 386,
      " 0.44": 387,
      "5 0.0": 388,
      "927": 389,
      "285": 390,
      "024": 391,
      " 1.000000 0.000000 0.000000": 392,
      "1 0.0": 393,
      "4 0.0": 394,
      "283": 395,
      " 0.34": 396,
      " -0.5": 397,
      "296": 398,
      " 0.45": 399,
      "903": 400,
      "025": 401,
      " -0.03": 402,
      " 0.41": 403,
      "286": 404,
      " 7": 405,
      " 4": 406,
      "221": 407,
      " 0.000000 0.7": 408,
      "026": 409,
      "231": 410,
      " 0.55": 411,
      "293": 412,
      "291": 413,
      "08\n": 414,
      "085": 415,
      "281": 416,
      "6 1": 417,
      " 0.35": 418,
      "92\n": 419,
      " -1.000000 0.000000 0.000000": 420,
      "299": 421,
      "4 1": 422,
      "5 1": 423,
      "081": 424,
      "826": 425,
      "054": 426,
      " 24": 427,
      "3 26": 428,
      " 0.75": 429,
      " 0.77": 430,
      "36\n": 431,
      "3 20": 432,
      "7 1": 433,
      "095": 434,
      "091": 435,
      " -0.04": 436,
      "097": 437,
      "214": 438,
      " 0.74": 439,
      "2 0.3": 440,
      "022": 441,
      "31\n": 442,
      "251": 443,
      "35\n": 444,
      "051": 445,
      " 0.66": 446,
      "65\n": 447,
      " -0.6": 448,
      "34\n": 449,
      "094": 450,
      "37\n": 451,
      " 0.20": 452,
      " 5": 453,
      " 0.54": 454,
      " 0.98": 455,
      "3 18": 456,
      "225": 457,
      "084": 458,
      "911": 459,
      "2 0.4": 460,
      "087": 461,
      "67\n": 462,
      " 0.71": 463,
      "0.0000": 464,
      "997": 465,
      "211": 466,
      " 0.000000 0.3": 467,
      "64\n": 468,
      "804": 469,
      "224": 470,
      "61\n": 471,
      "29\n": 472,
      "267": 473,
      " 25": 474,
      " 0.56": 475,
      "271": 476,
      "023": 477,
      "227": 478,
      "995": 479,
      "831": 480,
      " 0.47": 481,
      "247": 482,
      "215": 483,
      "057": 484,
      " 0.63": 485,
      " -0.999969": 486,
      "241": 487,
      " 0.43": 488,
      "086": 489,
      " 0.000000 -1.000000": 490,
      "055": 491,
      " 0.000000 1.000000": 492,
      "001": 493,
      "0 0.3": 494,
      "071": 495,
      "877": 496,
      "217": 497,
      "896": 498,
      "33\n": 499,
      "061": 500,
      "0.000000": 501,
      "66\n": 502,
      "951": 503,
      "011": 504,
      "077": 505,
      "897": 506,
      "235": 507,
      "954": 508,
      "236": 509,
      "09\n": 510,
      "2 0.5": 511,
      "261": 512,
      "993": 513,
      "216": 514,
      " 0.46": 515,
      "277": 516,
      "234": 517,
      "856": 518,
      "41\n": 519,
      "096": 520,
      "871": 521,
      "861": 522,
      "8 0.3": 523,
      "257": 524,
      "2 0.7": 525,
      "265": 526,
      "264": 527,
      "274": 528,
      "237": 529,
      "093": 530,
      "817": 531,
      " 0.001": 532,
      "865": 533,
      "894": 534,
      "-0.0000": 535,
      "841": 536,
      "074": 537,
      "891": 538,
      "015": 539,
      "031": 540,
      "254": 541,
      "857": 542,
      " -0.06": 543,
      "988": 544,
      "867": 545,
      "226": 546,
      "847": 547,
      "887": 548,
      "041": 549,
      "245": 550,
      "02\n": 551,
      "881": 552,
      "276": 553,
      "099": 554,
      "275": 555,
      "007": 556,
      " 0.33": 557,
      "893": 558,
      "957": 559,
      " 0.28": 560,
      "851": 561,
      "246": 562,
      "975": 563,
      "-0.05": 564,
      "994": 565,
      "941": 566,
      "255": 567,
      " 0.76": 568,
      "611": 569,
      "955": 570,
      " 0.36": 571,
      "971": 572,
      "800": 573,
      "3 -0.1": 574,
      "991": 575,
      "243": 576,
      "931": 577,
      "273": 578,
      "835": 579,
      "244": 580,
      "965": 581,
      "037": 582,
      "801": 583,
      "884": 584,
      "885": 585,
      " -0.05": 586,
      "671": 587,
      "51\n": 588,
      "937": 589,
      " 0.53": 590,
      "47\n": 591,
      "961": 592,
      "814": 593,
      "935": 594,
      " 3": 595,
      "266": 596,
      "825": 597,
      "80\n": 598,
      "967": 599,
      "837": 600,
      "066": 601,
      "45\n": 602,
      "57\n": 603,
      "044": 604,
      "866": 605,
      " 6": 606,
      "047": 607,
      "351": 608,
      "811": 609,
      "845": 610,
      "89\n": 611,
      "815": 612,
      "55\n": 613,
      "223": 614,
      "3 47": 615,
      "806": 616,
      "854": 617,
      "017": 618,
      "964": 619,
      "836": 620,
      "936": 621,
      "834": 622,
      "807": 623,
      "-1.000000 0.000000 0.000000": 624,
      "895": 625,
      "966": 626,
      "915": 627,
      "035": 628,
      "707": 629,
      "0.05": 630,
      "006": 631,
      "977": 632,
      "874": 633,
      "44\n": 634,
      "945": 635,
      "821": 636,
      "875": 637,
      "005": 638,
      "016": 639,
      "233": 640,
      "004": 641,
      "614": 642,
      "657": 643,
      " 0.73": 644,
      "824": 645,
      "288": 646,
      "864": 647,
      "934": 648,
      "863": 649,
      "805": 650,
      "045": 651,
      "947": 652,
      "946": 653,
      "944": 654,
      " 0.99996": 655,
      "065": 656,
      " 0.88": 657,
      "073": 658,
      "920": 659,
      "8 0.4": 660,
      "953": 661,
      "816": 662,
      "844": 663,
      "827": 664,
      "617": 665,
      "917": 666,
      "641": 667,
      "855": 668,
      "833": 669,
      " 47": 670,
      "93 -0.": 671,
      "036": 672,
      "344": 673,
      "341": 674,
      "014": 675,
      "374": 676,
      "645": 677,
      "928": 678,
      "046": 679,
      "82\n": 680,
      "0 0.4": 681,
      "256": 682,
      "375": 683,
      "298": 684,
      "914": 685,
      "846": 686,
      "899": 687,
      "347": 688,
      "263": 689,
      " 0.000000 0.5": 690,
      "311": 691,
      "354": 692,
      "063": 693,
      "956": 694,
      "56\n": 695,
      "076": 696,
      "822": 697,
      "843": 698,
      "067": 699,
      "043": 700,
      "0 0.5": 701,
      "9 0.6": 702,
      "29 ": 703,
      "371": 704,
      "3 51": 705,
      "345": 706,
      "0 0.7": 707,
      "9 -0.1": 708,
      "8 0.5": 709,
      "646": 710,
      "357": 711,
      "064": 712,
      "3 41": 713,
      "3 27": 714,
      "876": 715,
      "651": 716,
      "053": 717,
      "034": 718,
      "8 0.7": 719,
      "075": 720,
      "656": 721,
      "316": 722,
      "033": 723,
      "253": 724,
      "916": 725,
      "315": 726,
      "676": 727,
      "974": 728,
      "675": 729,
      "-0.023": 730,
      "213": 731,
      "976": 732,
      "92 ": 733,
      "54\n": 734,
      "654": 735,
      "655": 736,
      " 0.000000 0.1": 737,
      "886": 738,
      "644": 739,
      "317": 740,
      "314": 741,
      "74\n": 742,
      "963": 743,
      "823": 744,
      "933": 745,
      "355": 746,
      "616": 747,
      "674": 748,
      "647": 749,
      " 51": 750,
      " -0.99996": 751,
      ".000000 0.000000 0.000000": 752,
      "615": 753,
      "677": 754,
      "377": 755,
      "290": 756,
      "29 -0.": 757,
      "003": 758,
      "013": 759,
      "643": 760,
      " 0.90": 761,
      "346": 762,
      "376": 763,
      "0.007": 764,
      "98 ": 765,
      "46\n": 766,
      "3 71": 767,
      "056": 768,
      "343": 769,
      "-0.011": 770,
      "474": 771,
      "883": 772,
      "71\n": 773,
      "-0.021": 774,
      " 41": 775,
      "313": 776,
      "3 57": 777,
      " -0.14": 778,
      "373": 779,
      "803": 780,
      "673": 781,
      " 26": 782,
      " -0.11": 783,
      "853": 784,
      "92 1": 785,
      "0.011": 786,
      "2 0.6": 787,
      " -0.07": 788,
      "09 ": 789,
      "813": 790,
      "75\n": 791,
      "90 ": 792,
      "3 44": 793,
      "356": 794,
      "943": 795,
      "86 1": 796,
      "87 1": 797,
      "666": 798,
      "873": 799,
      "475": 800,
      "90 1": 801,
      " 0.92": 802,
      "477": 803,
      "85 1": 804,
      "363": 805,
      "97 1": 806,
      "29 0.0": 807,
      "03 -0.": 808,
      "86 ": 809,
      "15\n": 810,
      "411": 811,
      "84 1": 812,
      "571": 813,
      "23 -0.": 814,
      "17\n": 815,
      "517": 816,
      "9 0.00": 817,
      "28 1": 818,
      "653": 819,
      "77\n": 820,
      "088": 821,
      "96 ": 822,
      "94 ": 823,
      "97 ": 824,
      "95 1": 825,
      "29 1": 826,
      "91 ": 827,
      "87 ": 828,
      "76\n": 829,
      "973": 830,
      "91 1": 831,
      "414": 832,
      "98 1": 833,
      "95 ": 834,
      "3 77": 835,
      "99 ": 836,
      "415": 837,
      "446": 838,
      "85 ": 839,
      "96 1": 840,
      "00 ": 841,
      "01 1": 842,
      "14\n": 843,
      " 0.000000 0.6": 844,
      "0.021": 845,
      "01 ": 846,
      "511": 847,
      "28 ": 848,
      " -0.15": 849,
      "84 ": 850,
      "05 1": 851,
      "913": 852,
      " 0.0000": 853,
      "25 1": 854,
      "11\n": 855,
      "93 1": 856,
      " 0.000000 0.0": 857,
      "03 0.1": 858,
      "3 35": 859,
      "416": 860,
      "575": 861,
      "82 ": 862,
      "21 1": 863,
      "07 1": 864,
      "-0.014": 865,
      "711": 866,
      "99 1": 867,
      "3 45": 868,
      "24 1": 869,
      "88 1": 870,
      "16\n": 871,
      "22 1": 872,
      "88 ": 873,
      "3 111": 874,
      "27 1": 875,
      "06 1": 876,
      "00 1": 877,
      "81 1": 878,
      "94 1": 879,
      "27 ": 880,
      "471": 881,
      "26 1": 882,
      "3 34": 883,
      "80 ": 884,
      "04 1": 885,
      "09 1": 886,
      "333": 887,
      "89 ": 888,
      "25 ": 889,
      " 0.707": 890,
      "514": 891,
      "3 55": 892,
      "24 ": 893,
      "26 ": 894,
      "04 ": 895,
      "29 0.": 896,
      "3 31": 897,
      "828": 898,
      "292": 899,
      "417": 900,
      "3 86": 901,
      "663": 902,
      "574": 903,
      "476": 904,
      "613": 905,
      "0.014": 906,
      "0.023": 907,
      "83 -0.": 908,
      "3 81": 909,
      "546": 910,
      "9 4": 911,
      "353": 912,
      "05 ": 913,
      "22 ": 914,
      "07 ": 915,
      "3 37": 916,
      "06 ": 917,
      "20 1": 918,
      "3 85": 919,
      "21 ": 920,
      "576": 921,
      "577": 922,
      "02 ": 923,
      "028": 924,
      "456": 925,
      "454": 926,
      "445": 927,
      "516": 928,
      "20 -0.": 929,
      "-0.007": 930,
      "20 ": 931,
      "515": 932,
      "02 1": 933,
      "81 ": 934,
      "090": 935,
      "3 64": 936,
      "92 -0.": 937,
      "463": 938,
      "717": 939,
      "444": 940,
      "3 83": 941,
      "2 4": 942,
      "898": 943,
      "2 -0.1": 944,
      "80 -0.": 945,
      "3 67": 946,
      "554": 947,
      "116": 948,
      "174": 949,
      "3 61": 950,
      "08 1": 951,
      "23 1": 952,
      "443": 953,
      "556": 954,
      "3 -0.00": 955,
      "-0.017": 956,
      "715": 957,
      "098": 958,
      "2 7": 959,
      "3 65": 960,
      "3 84": 961,
      "9 7": 962,
      "0.022": 963,
      "413": 964,
      "9 0.99": 965,
      "83 0.1": 966,
      "8 4": 967,
      "0 4": 968,
      "208": 969,
      "0.017": 970,
      "2 0.00": 971,
      "90 -0.": 972,
      "716": 973,
      "3 96": 974,
      "87 0.1": 975,
      "3 104": 976,
      "0.004": 977,
      "-0.001": 978,
      "9 0.14": 979,
      "117": 980,
      "-0.015": 981,
      "08 ": 982,
      "9 11": 983,
      "3 87": 984,
      "3 100": 985,
      "09 -0.": 986,
      "714": 987,
      "563": 988,
      "3 94": 989,
      "9 5": 990,
      "0 -0.1": 991,
      "543": 992,
      "22 -0.": 993,
      "453": 994,
      "0.024": 995,
      "27 -0.": 996,
      "0.026": 997,
      "3 99": 998,
      "2 5": 999,
      "82 -0.": 1000,
      "3 93": 1001,
      " 0.000000 0.99": 1002,
      "92 0.1": 1003,
      "713": 1004,
      "2 11": 1005,
      "94 -0.": 1006,
      "3 91": 1007,
      "06 -0.": 1008,
      "555": 1009,
      "31 1": 1010,
      "774": 1011,
      "3 103": 1012,
      "86 -0.": 1013,
      "96 -0.": 1014,
      "3 95": 1015,
      "3 121": 1016,
      "3 107": 1017,
      "8 7": 1018,
      "01 0.1": 1019,
      "0 0.6": 1020,
      "383": 1021,
      "-0.024": 1022,
      "0.027": 1023,
      "05 -0.": 1024,
      "573": 1025,
      "85 -0.": 1026,
      "97 -0.": 1027,
      "-0.005": 1028,
      "06 0.1": 1029,
      "1 1": 1030,
      "37 1": 1031,
      " -0.001": 1032,
      "81 0.0": 1033,
      "34 1": 1034,
      "020": 1035,
      "9 0.11": 1036,
      "3 97": 1037,
      "473": 1038,
      "820": 1039,
      "0.025": 1040,
      "89 1": 1041,
      "86 0.1": 1042,
      "06 0.0": 1043,
      "775": 1044,
      "36 1": 1045,
      "97 0.1": 1046,
      "31 ": 1047,
      " 0.0001": 1048,
      "-0.025": 1049,
      "513": 1050,
      "87 -0.": 1051,
      "0 7": 1052,
      "81 -0.": 1053,
      "-0.022": 1054,
      "84 -0.": 1055,
      "3 122": 1056,
      " 0.000000 0.9": 1057,
      "81 0.1": 1058,
      "88 -0.": 1059,
      "0 5": 1060,
      "808": 1061,
      "3 105": 1062,
      "0.005": 1063,
      "35 1": 1064,
      " -0.16": 1065,
      "95 -0.": 1066,
      "02 -0.": 1067,
      "176": 1068,
      "21 0.1": 1069,
      "01 0.0": 1070,
      "3 101": 1071,
      "3 106": 1072,
      "26 -0.": 1073,
      "890": 1074,
      "35 ": 1075,
      "0.015": 1076,
      "-0.013": 1077,
      " -0.13": 1078,
      "8 5": 1079,
      "07 -0.": 1080,
      "80 1": 1081,
      "89 -0.": 1082,
      "2 -0.00": 1083,
      "3 141": 1084,
      "65 1": 1085,
      "04 0.1": 1086,
      "82 1": 1087,
      " 0.0003": 1088,
      "04 -0.": 1089,
      "0 -0.00": 1090,
      "8 0.6": 1091,
      "24 -0.": 1092,
      "07 0.1": 1093,
      "3 46": 1094,
      "95 0.1": 1095,
      "3 123": 1096,
      "0.006": 1097,
      "99 0.1": 1098,
      "98 -0.": 1099,
      "38 1": 1100,
      "01 -0.": 1101,
      "3 124": 1102,
      " 0.000000 1.000000 0.000000": 1103,
      "777": 1104,
      "21 -0.": 1105,
      "37 ": 1106,
      "9 3": 1107,
      "175": 1108,
      "84 0.0": 1109,
      "7 4": 1110,
      "2 0.8": 1111,
      "66 1": 1112,
      "0 11": 1113,
      "092": 1114,
      "91 -0.": 1115,
      "3 131": 1116,
      "61 -0.": 1117,
      "09 0.": 1118,
      "36 ": 1119,
      "114": 1120,
      "-0.016": 1121,
      "25 0.1": 1122,
      "2 3": 1123,
      "8 11": 1124,
      "3 74": 1125,
      "67 1": 1126,
      "05 0.1": 1127,
      "61 1": 1128,
      "64 1": 1129,
      "3 134": 1130,
      "9 0.15": 1131,
      "5 4": 1132,
      "34 ": 1133,
      "3 126": 1134,
      "25 -0.": 1135,
      "6 4": 1136,
      "98 0.1": 1137,
      "3 127": 1138,
      " 0.005": 1139,
      "4 4": 1140,
      "94 0.1": 1141,
      "27 0.1": 1142,
      "2 0.2": 1143,
      "3 137": 1144,
      "1 4": 1145,
      "22 0.0": 1146,
      "753": 1147,
      "85 0.1": 1148,
      "00 -0.": 1149,
      " 0.000000 -1.000000 0.000000": 1150,
      "553": 1151,
      "8 3": 1152,
      "0.013": 1153,
      "113": 1154,
      "31 -0.": 1155,
      "03 0.0": 1156,
      "-0.026": 1157,
      "89 0.": 1158,
      "28 -0.": 1159,
      "-0.06": 1160,
      "3 33": 1161,
      "9 6": 1162,
      "0.06": 1163,
      "3 125": 1164,
      "64 ": 1165,
      "65 ": 1166,
      " 0.007": 1167,
      "90 0.1": 1168,
      "776": 1169,
      "22 0.1": 1170,
      "2 6": 1171,
      "26 0.1": 1172,
      "20 0.1": 1173,
      "38 ": 1174,
      "04 0.0": 1175,
      "8 -0.00": 1176,
      "0 3": 1177,
      "41 1": 1178,
      "115": 1179,
      "88 0.1": 1180,
      "91 0.1": 1181,
      "0 0.11": 1182,
      "9 0.000000": 1183,
      "96 0.1": 1184,
      "5 7": 1185,
      "4 7": 1186,
      "84 0.1": 1187,
      "61 ": 1188,
      "4 5": 1189,
      "0 6": 1190,
      "99 -0.": 1191,
      "6 5": 1192,
      "3 117": 1193,
      "2 0.9": 1194,
      "3 164": 1195,
      "-0.027": 1196,
      "3 147": 1197,
      "2 0.11": 1198,
      "9 14": 1199,
      "3 54": 1200,
      "36 -0.": 1201,
      "08 -0.": 1202,
      "3 135": 1203,
      "2 14": 1204,
      "3 151": 1205,
      "3 157": 1206,
      "3 75": 1207,
      "0 0.2": 1208,
      "66 ": 1209,
      "763": 1210,
      "47 1": 1211,
      "8 6": 1212,
      "5 5": 1213,
      "7 5": 1214,
      "9 21": 1215,
      "6 7": 1216,
      "3 36": 1217,
      "-0.006": 1218,
      "9 0.07": 1219,
      "02 0.1": 1220,
      "7 7": 1221,
      "67 ": 1222,
      "37 -0.": 1223,
      "0 0.8": 1224,
      "86 0.0": 1225,
      "163": 1226,
      "8 -0.1": 1227,
      "00 0.1": 1228,
      "26 0.0": 1229,
      "67 -0.": 1230,
      "45 1": 1231,
      "44 1": 1232,
      "1 7": 1233,
      "3 165": 1234,
      "31 0.1": 1235,
      " 0.003": 1236,
      "92 0.0": 1237,
      "111": 1238,
      "5 3": 1239,
      "23 0.1": 1240,
      "64 -0.": 1241,
      "08 0.0": 1242,
      "1 5": 1243,
      "51 1": 1244,
      "95 0.0": 1245,
      "57 1": 1246,
      "4 3": 1247,
      "91 0.0": 1248,
      "0.016": 1249,
      "3 114": 1250,
      "65 -0.": 1251,
      "24 0.1": 1252,
      "-0.004": 1253,
      "999969": 1254,
      "93 0.1": 1255,
      "98 0.0": 1256,
      "3 144": 1257,
      "34 -0.": 1258,
      "9 22": 1259,
      "05 0.0": 1260,
      "83 0.0": 1261,
      "6 3": 1262,
      "38 -0.": 1263,
      "09 0.1": 1264,
      " 0.207": 1265,
      "66 -0.": 1266,
      "048": 1267,
      "46 1": 1268,
      "9 0.05": 1269,
      "88 0.0": 1270,
      "2 21": 1271,
      "28 0.1": 1272,
      "96 0.0": 1273,
      "35 -0.": 1274,
      "773": 1275,
      "9 15": 1276,
      "1 3": 1277,
      "3 167": 1278,
      "97 0.0": 1279,
      "3 66": 1280,
      "-0.031": 1281,
      "3 76": 1282,
      "3 43": 1283,
      "6 6": 1284,
      "7 3": 1285,
      "41 ": 1286,
      " 0.206": 1287,
      "3 199": 1288,
      "67 0.1": 1289,
      "55 1": 1290,
      "25 0.0": 1291,
      "65 0.1": 1292,
      "0 14": 1293,
      "21 0.0": 1294,
      "-0.1": 1295,
      "54 1": 1296,
      "3 -0.3": 1297,
      "29 0.1": 1298,
      "3 161": 1299,
      "94 0.0": 1300,
      "3 56": 1301,
      "99 0.0": 1302,
      "3 187": 1303,
      "90 0.0": 1304,
      "48 1": 1305,
      "8 0.00": 1306,
      "34 0.1": 1307,
      "2 22": 1308,
      "51 ": 1309,
      "37 0.1": 1310,
      "71 1": 1311,
      "153": 1312,
      "68 1": 1313,
      "9 0.01": 1314,
      "85 0.0": 1315,
      "8 0.8": 1316,
      " 0.999969 0.": 1317,
      " 0.000000 0.8": 1318,
      "08 0.1": 1319,
      "2 15": 1320,
      "28 0.0": 1321,
      "57 ": 1322,
      "56 1": 1323,
      "61 0.1": 1324,
      "0.003": 1325,
      "802": 1326,
      "173": 1327,
      "58 1": 1328,
      "743": 1329,
      "0.020": 1330,
      "27 0.0": 1331,
      "47 ": 1332,
      "87 0.0": 1333,
      "3 197": 1334,
      "00 0.0": 1335,
      "0.031": 1336,
      "36 0.1": 1337,
      "4 6": 1338,
      "44 ": 1339,
      " 0.923": 1340,
      "018": 1341,
      "9 13": 1342,
      "5 6": 1343,
      "07 0.0": 1344,
      "9 0.04": 1345,
      "3 53": 1346,
      "1 6": 1347,
      "3 196": 1348,
      " 0.004": 1349,
      "0 21": 1350,
      "7 6": 1351,
      "2 17": 1352,
      "3 -0.7": 1353,
      "38 0.1": 1354,
      "78 1": 1355,
      " 0.999969 0.000000 0.000000": 1356,
      "000031": 1357,
      "3 204": 1358,
      "3 205": 1359,
      "998": 1360,
      "3 115": 1361,
      "3 183": 1362,
      "8 21": 1363,
      "0 22": 1364,
      "9 17": 1365,
      "-0.003": 1366,
      "3 194": 1367,
      "41 -0.": 1368,
      "3 200": 1369,
      "0 15": 1370,
      "2 0.07": 1371,
      "3 203": 1372,
      "45 ": 1373,
      "3 185": 1374,
      "9 -0.7": 1375,
      "3 155": 1376,
      "66 0.1": 1377,
      "77 1": 1378,
      "3 186": 1379,
      "143": 1380,
      "3 207": 1381,
      "0.07": 1382,
      "75 1": 1383,
      "24 0.0": 1384,
      "47 0.1": 1385,
      "3 206": 1386,
      "76 1": 1387,
      "2 0.14": 1388,
      "3 171": 1389,
      "0 0.14": 1390,
      "-0.020": 1391,
      " -0.999969 0.": 1392,
      "3 145": 1393,
      "93 0.0": 1394,
      "65 0.0": 1395,
      "8 0.2": 1396,
      "8 14": 1397,
      "57 -0.": 1398,
      "20 0.0": 1399,
      "51 -0.": 1400,
      "35 0.1": 1401,
      "74 1": 1402,
      "3 184": 1403,
      "46 ": 1404,
      "9 0.13": 1405,
      "0 0.00": 1406,
      "3 191": 1407,
      "55 ": 1408,
      "3 -0.4": 1409,
      "9 -0.4": 1410,
      "11 1": 1411,
      "18 1": 1412,
      "64 0.1": 1413,
      "2 13": 1414,
      "3 88": 1415,
      "3 63": 1416,
      "17 1": 1417,
      "9 16": 1418,
      "0 0.07": 1419,
      "54 ": 1420,
      "16 1": 1421,
      "8 22": 1422,
      "15 1": 1423,
      "3 177": 1424,
      "3 201": 1425,
      "0 0.9": 1426,
      "47 -0.": 1427,
      "707083": 1428,
      "37 0.0": 1429,
      "3 -0.5": 1430,
      "3 195": 1431,
      "56 ": 1432,
      "3 193": 1433,
      "09 0.0": 1434,
      "0 13": 1435,
      "9 0.17": 1436,
      "80 0.1": 1437,
      "71 ": 1438,
      " 0.203": 1439,
      "3 73": 1440,
      "0 -0.3": 1441,
      "14 1": 1442,
      "0.11": 1443,
      "02 0.0": 1444,
      "2 0.15": 1445,
      "33 0.1": 1446,
      "3 28": 1447,
      "0.000000 0.0": 1448,
      "3 154": 1449,
      "9 0.22": 1450,
      "948": 1451,
      "9 -0.3": 1452,
      "9 -0.5": 1453,
      "9 0.23": 1454,
      "0 17": 1455,
      "23 0.0": 1456,
      "36 0.0": 1457,
      " 0.0004": 1458,
      " 0.006": 1459,
      "892": 1460,
      "3 116": 1461,
      " 0.707083": 1462,
      "51 0.1": 1463,
      "8 15": 1464,
      "2 0.01": 1465,
      " 0.000000 0.999969": 1466,
      "3 113": 1467,
      "2 0.05": 1468,
      " 0.706": 1469,
      "2 0.22": 1470,
      " 20": 1471,
      "77 ": 1472,
      " 0.200": 1473,
      "3 136": 1474,
      "2 16": 1475,
      "56 -0.": 1476,
      " -0.0001": 1477,
      "0 -0.7": 1478,
      "0 0.05": 1479,
      "41 0.1": 1480,
      " 0.999969 -0.00": 1481,
      "3 181": 1482,
      "75 ": 1483,
      " 0.000000 0.2": 1484,
      "74 ": 1485,
      "0 0.21": 1486,
      "0214": 1487,
      "2 0.99": 1488,
      "31 0.0": 1489,
      "11 ": 1490,
      " 203": 1491,
      " 207": 1492,
      "3 48": 1493,
      "2 -0.7": 1494,
      " -0.0003": 1495,
      "958": 1496,
      "17 ": 1497,
      "67 0.0": 1498,
      "57 0.1": 1499,
      "038": 1500,
      "083 -0.": 1501,
      "978": 1502,
      "34 0.0": 1503,
      "44 -0.": 1504,
      "76 ": 1505,
      "3 143": 1506,
      "238": 1507,
      "3 133": 1508,
      "14 ": 1509,
      "9 0.21": 1510,
      " 204": 1511,
      "968": 1512,
      "0 0.22": 1513,
      " 200": 1514,
      "-0.07": 1515,
      "0 0.15": 1516,
      "604": 1517,
      "0.001": 1518,
      "0.035": 1519,
      " 0.000000 -0.99": 1520,
      "248": 1521,
      "16 ": 1522,
      "3 38": 1523,
      "0.000000 0.1": 1524,
      " 0.201": 1525,
      "64 0.0": 1526,
      "15 ": 1527,
      "2 0.23": 1528,
      " 205": 1529,
      " 0.000000 0.000000 1.000000 0.4": 1530,
      "9 -0.01": 1531,
      "61 0.0": 1532,
      "9 23": 1533,
      " -0.999969 -0.00": 1534,
      "3 174": 1535,
      "068": 1536,
      "3 78": 1537,
      "2 0.17": 1538,
      "44 0.1": 1539,
      "0 16": 1540,
      "348": 1541,
      "3 -0.01": 1542,
      " 0.205": 1543,
      " 201": 1544,
      " 0.000000 0.00": 1545,
      "2 -0.5": 1546,
      "3 68": 1547,
      "66 0.0": 1548,
      "71 -0.": 1549,
      "80 0.0": 1550,
      "2 -0.3": 1551,
      "2 -0.4": 1552,
      " 206": 1553,
      " 0.000000 -0.999969": 1554,
      "848": 1555,
      "-0.035": 1556,
      "9908": 1557,
      "258": 1558,
      "35 0.0": 1559,
      "8 -0.7": 1560,
      " 0.499": 1561,
      "3 146": 1562,
      "3 153": 1563,
      "55 -0.": 1564,
      "2 0.04": 1565,
      "815\n": 1566,
      "9 0.16": 1567,
      "3 -0.99": 1568,
      "278": 1569,
      "078": 1570,
      "0.000029 0.0": 1571,
      " 0.000000 0.000000 -1.000000 0.7": 1572,
      "3 166": 1573,
      "0 -0.4": 1574,
      "46 -0.": 1575,
      " 0.986": 1576,
      "268": 1577,
      "45 0.1": 1578,
      "71 0.1": 1579,
      "0 -0.5": 1580,
      "16 -0.": 1581,
      "9 0.06": 1582,
      "33 0.0": 1583,
      "45 -0.": 1584,
      "8 -0.4": 1585,
      "0275": 1586,
      "9 -0.99": 1587,
      "9 0.24": 1588,
      "2 0.21": 1589,
      "0 -0.99": 1590,
      "0 0.17": 1591,
      "43 0.1": 1592,
      " 0.204": 1593,
      "54 -0.": 1594,
      "48 0.1": 1595,
      "9 0.000000 -0.": 1596,
      "878": 1597,
      "38 0.0": 1598,
      "3 175": 1599,
      "2 23": 1600,
      "008": 1601,
      "3 156": 1602,
      "0 0.99": 1603,
      "-0.034": 1604,
      "0 0.23": 1605,
      "-0.000003": 1606,
      "0244": 1607,
      "218": 1608,
      "368": 1609,
      "9 0.03": 1610,
      " 0.000000 0.000000 -0.999969": 1611,
      "0 0.13": 1612,
      " 0.221": 1613,
      "908": 1614,
      " 0.826": 1615,
      "000061": 1616,
      "868": 1617,
      " 0.384": 1618,
      "918": 1619,
      "3 98": 1620,
      "76 -0.": 1621,
      "8 -0.3": 1622,
      "838": 1623,
      "55 0.1": 1624,
      "3 -0.6": 1625,
      "54 0.1": 1626,
      "938": 1627,
      "0 0.01": 1628,
      "3 163": 1629,
      "6 21": 1630,
      "0 0.06": 1631,
      "8 -0.5": 1632,
      " 0.300": 1633,
      "77 -0.": 1634,
      "5 21": 1635,
      "4 22": 1636,
      " 0.701": 1637,
      "-0.0015": 1638,
      "050\n": 1639,
      "2 0.13": 1640,
      " 0.211": 1641,
      "3 108": 1642,
      " 0.984": 1643,
      "4 21": 1644,
      "0.034": 1645,
      "6 22": 1646,
      "0641": 1647,
      " 0.981": 1648,
      "2 0.06": 1649,
      "2 0.000000": 1650,
      "7 21": 1651,
      "0824": 1652,
      "2 -0.01": 1653,
      " 0.217": 1654,
      " 0.000000 0.000000 0.999969": 1655,
      "0.028": 1656,
      "818": 1657,
      "2 -0.99": 1658,
      " -0.999969 0.000000 0.000000": 1659,
      "223\n": 1660,
      "858": 1661,
      "058": 1662,
      " 0.383": 1663,
      " 0.000000 0.000000 -1.000000 0.4": 1664,
      "228": 1665,
      "51 0.0": 1666,
      " 0.0007": 1667,
      "842\n": 1668,
      "3 58": 1669,
      "74 -0.": 1670,
      " 0.235": 1671,
      "0 0.04": 1672,
      " 0.924": 1673,
      " 0.544": 1674,
      "75 -0.": 1675,
      "76 0.1": 1676,
      "5 22": 1677,
      "58 0.1": 1678,
      "2 0.16": 1679,
      "-0.0104": 1680,
      "0 23": 1681,
      "0.3": 1682,
      "63 0.1": 1683,
      " 0.227": 1684,
      "3 90": 1685,
      "9 0.25": 1686,
      "3 211": 1687,
      "9 -0.6": 1688,
      " 0.296": 1689,
      "031\n": 1690,
      "44 0.0": 1691,
      " 0.985": 1692,
      "278\n": 1693,
      "47 0.0": 1694,
      "3 215": 1695,
      " 0.337": 1696,
      "277\n": 1697,
      " 0.381": 1698,
      "56 0.0": 1699,
      "15 -0.": 1700,
      "658": 1701,
      " 0.371": 1702,
      "3 -1.000000 0.000000 0.000000": 1703,
      " 0.699": 1704,
      "2 0.24": 1705,
      " 0.311": 1706,
      "0.15": 1707,
      " 0.987": 1708,
      "888": 1709,
      " 227": 1710,
      " 0.291": 1711,
      "45 0.0": 1712,
      " 0.500": 1713,
      "2 -0.6": 1714,
      "930\n": 1715,
      " 0.231": 1716,
      "358": 1717,
      "9 0.97": 1718,
      "13 0.1": 1719,
      "57 0.0": 1720,
      "0 -0.6": 1721,
      " 215": 1722,
      "17 -0.": 1723,
      "9 0.96": 1724,
      "15 0.0": 1725,
      " 0.326": 1726,
      " 0.751": 1727,
      " 0.922": 1728,
      "9939": 1729,
      " 0.214": 1730,
      "618": 1731,
      "1 21": 1732,
      "648": 1733,
      "71 0.0": 1734,
      " 0.224": 1735,
      "318": 1736,
      "3 176": 1737,
      " 0.567": 1738,
      " 0.927": 1739,
      " 0.297": 1740,
      "7 22": 1741,
      "3 173": 1742,
      "8 -0.99": 1743,
      "3 217": 1744,
      " 0.000031": 1745,
      "0 0.25": 1746,
      "3 227": 1747,
      "000092": 1748,
      "1 22": 1749,
      " 0.241": 1750,
      "11 0.1": 1751,
      " 0.324": 1752,
      "-0.036": 1753,
      "378": 1754,
      "53 0.1": 1755,
      "9 0.000000 0.000000 1.000000": 1756,
      "9 0.95": 1757,
      " 0.215": 1758,
      " 217": 1759,
      "14 -0.": 1760,
      " 0.285": 1761,
      " 0.325": 1762,
      "0 -0.01": 1763,
      "3 128": 1764,
      "41 0.0": 1765,
      " 0.865": 1766,
      " 211": 1767,
      " 0.257": 1768,
      " 0.286": 1769,
      "678": 1770,
      "-0.00214": 1771,
      " 221": 1772,
      "3 231": 1773,
      "8 23": 1774,
      "14 0.1": 1775,
      " 0.564": 1776,
      " 0.283": 1777,
      " 0.994": 1778,
      " 0.331": 1779,
      "3 221": 1780,
      "55 0.0": 1781,
      " 0.000000 0.000000 -0.999969 0.": 1782,
      "3 214": 1783,
      " 0.561": 1784,
      "0.036": 1785,
      "343\n": 1786,
      "2 0.27": 1787,
      "0.037": 1788,
      " 231": 1789,
      "668": 1790,
      "0.033": 1791,
      "3 225": 1792,
      "2 0.25": 1793,
      "0671": 1794,
      "95 0.3": 1795,
      "0 0.000000": 1796,
      "56 0.1": 1797,
      " 0.925": 1798,
      "2 0.03": 1799,
      "3 118": 1800,
      "260\n": 1801,
      "251\n": 1802,
      "9 0.26": 1803,
      "73 0.1": 1804,
      "0.041": 1805,
      " -0.007": 1806,
      " 0.387": 1807,
      " 0.451": 1808,
      "289\n": 1809,
      "0885": 1810,
      " 0.225": 1811,
      "082\n": 1812,
      " 0.294": 1813,
      "-0.033": 1814,
      "3 1.000000 0.000000 0.000000": 1815,
      "9777": 1816,
      " 0.591": 1817,
      "15 0.1": 1818,
      "974\n": 1819,
      "846\n": 1820,
      "75 0.1": 1821,
      " 0.996": 1822,
      "16 0.1": 1823,
      " -0.004": 1824,
      "911\n": 1825,
      " 0.906": 1826,
      "0.0122": 1827,
      " 0.900": 1828,
      "11 -0.": 1829,
      " 0.237": 1830,
      "0 0.000000 -0.": 1831,
      " 214": 1832,
      " 0.234": 1833,
      "0427": 1834,
      " 0.441": 1835,
      " 0.995": 1836,
      " -0.003": 1837,
      "3 138": 1838,
      "083 -0.707083": 1839,
      " 0.511": 1840,
      "0.0105": 1841,
      "0 0.24": 1842,
      "2 0.93": 1843,
      " 0.899": 1844,
      "847\n": 1845,
      "8 -0.01": 1846,
      "43 0.0": 1847,
      "18 0.1": 1848,
      " 0.301": 1849,
      "2 0.26": 1850,
      "257\n": 1851,
      "953\n": 1852,
      " 0.997": 1853,
      "610\n": 1854,
      " 225": 1855,
      "865\n": 1856,
      "-0.000000": 1857,
      " 0.926": 1858,
      "3 224": 1859,
      " 0.393": 1860,
      "54 0.0": 1861,
      " 224": 1862,
      " 0.322": 1863,
      "68 0.1": 1864,
      "248\n": 1865,
      "261\n": 1866,
      "242\n": 1867,
      " 0.334": 1868,
      "9 0.27": 1869,
      "-0.037": 1870,
      "05 0.5": 1871,
      "970\n": 1872,
      " 0.327": 1873,
      "241\n": 1874,
      "9 0.91": 1875,
      "9 0.93": 1876,
      " 0.000000 0.97": 1877,
      "954\n": 1878,
      "8 -0.6": 1879,
      " 0.000000 0.000000 -1.000000 0.1": 1880,
      "014\n": 1881,
      " 0.983": 1882,
      " -0.005": 1883,
      " 0.335": 1884,
      " 0.726": 1885,
      "0 -1.000000 0.000000 0.000000": 1886,
      " 0.000000 0.96": 1887,
      " 0.796": 1888,
      "811\n": 1889,
      " 0.216": 1890,
      " 0.535": 1891,
      " 0.744": 1892,
      "77 0.1": 1893,
      "3 148": 1894,
      " -0.006": 1895,
      "0 0.16": 1896,
      "46 0.1": 1897,
      "0 0.97": 1898,
      " 0.244": 1899,
      " 0.394": 1900,
      " 0.731": 1901,
      " 0.627": 1902,
      " 0.703": 1903,
      "14 0.0": 1904,
      "938\n": 1905,
      " 0.295": 1906,
      "73 0.0": 1907,
      "0 0.91": 1908,
      "0.14": 1909,
      "889\n": 1910,
      "227\n": 1911,
      "-0.028": 1912,
      "78 0.1": 1913,
      "866\n": 1914,
      " 0.386": 1915,
      "338": 1916,
      "9 20": 1917,
      "996\n": 1918,
      " 0.534": 1919,
      " 0.254": 1920,
      "3 226": 1921,
      "841\n": 1922,
      "920\n": 1923,
      "9 1.000000 0.000000 0.000000": 1924,
      "-0.0122": 1925,
      "2 0.95": 1926,
      "034\n": 1927,
      "46 0.0": 1928,
      "2 0.97": 1929,
      " 0.917": 1930,
      "989\n": 1931,
      "916\n": 1932,
      "266\n": 1933,
      "8581": 1934,
      "913\n": 1935,
      " 0.303": 1936,
      " 0.593": 1937,
      " 0.767": 1938,
      "61 0.4": 1939,
      "055\n": 1940,
      "839\n": 1941,
      "9451": 1942,
      " 0.000000 0.000000 0.999969 0.": 1943,
      "941\n": 1944,
      "934\n": 1945,
      "9 0.86": 1946,
      "0 1.000000 0.000000 0.000000": 1947,
      "234\n": 1948,
      " 0.866": 1949,
      "877\n": 1950,
      "914\n": 1951,
      " 0.284": 1952,
      " 0.306": 1953,
      " 0.367": 1954,
      " 0.341": 1955,
      "-0.041": 1956,
      "992\n": 1957,
      "976\n": 1958,
      "944\n": 1959,
      " 0.607": 1960,
      " 0.504": 1961,
      " 0.786": 1962,
      "360\n": 1963,
      " 0.684": 1964,
      " 0.293": 1965,
      " 0.000000 0.000000 1.000000 0.0": 1966,
      " 0.304": 1967,
      "3 -0.03": 1968,
      "2 0.000000 -0.": 1969,
      " 0.696": 1970,
      "3 216": 1971,
      "951\n": 1972,
      " 0.423": 1973,
      "6 -0.7": 1974,
      "647\n": 1975,
      " 0.907": 1976,
      "3 188": 1977,
      "966\n": 1978,
      "578": 1979,
      "548": 1980,
      "9 -1.000000 0.000000 0.000000": 1981,
      "7 -0.7": 1982,
      " 0.391": 1983,
      "9 -0.03": 1984,
      "290\n": 1985,
      "2122": 1986,
      "340\n": 1987,
      "957\n": 1988,
      "064\n": 1989,
      "9825\n": 1990,
      "74 0.1": 1991,
      "2 0.96": 1992,
      "980\n": 1993,
      "17 0.1": 1994,
      "48 0.0": 1995,
      "071\n": 1996,
      " 0.317": 1997,
      " 0.299": 1998,
      "2 0.86": 1999,
      "3 82": 2000,
      " 0.461": 2001,
      " 0.431": 2002,
      " 0.287": 2003,
      " 0.501": 2004,
      " 0.746": 2005,
      "210\n": 2006,
      "0 24": 2007,
      " 0.800": 2008,
      "3 80": 2009,
      "0458": 2010,
      "053\n": 2011,
      "946\n": 2012,
      " 0.434": 2013,
      " 0.578": 2014,
      " 0.664": 2015,
      "78 0.0": 2016,
      " 226": 2017,
      "856\n": 2018,
      "9 -0.04": 2019,
      "965\n": 2020,
      " 0.361": 2021,
      " 0.765": 2022,
      "641\n": 2023,
      "873\n": 2024,
      "838\n": 2025,
      " 0.999969 0.00": 2026,
      "011\n": 2027,
      "837\n": 2028,
      " 0.365": 2029,
      " 0.471": 2030,
      "2075": 2031,
      "947\n": 2032,
      " 0.555": 2033,
      " 0.667": 2034,
      "-0.0077": 2035,
      "3 120": 2036,
      "959\n": 2037,
      "53 0.0": 2038,
      "955\n": 2039,
      "338\n": 2040,
      "068\n": 2041,
      " 0.537": 2042,
      " -0.707": 2043,
      "001\n": 2044,
      "964\n": 2045,
      " 0.397": 2046,
      " 0.487": 2047,
      "089\n": 2048,
      " 0.991": 2049,
      "017\n": 2050,
      " 0.400": 2051,
      "2 0.91": 2052,
      "030\n": 2053,
      "279\n": 2054,
      "817\n": 2055,
      " 0.281": 2056,
      " 0.000000 -0.7": 2057,
      "226\n": 2058,
      "975\n": 2059,
      " 0.599": 2060,
      "282\n": 2061,
      " 0.683": 2062,
      "748": 2063,
      " 0.323": 2064,
      " 0.723": 2065,
      "13 0.0": 2066,
      " 0.247": 2067,
      "2 -1.000000 0.000000 0.000000": 2068,
      " 0.931": 2069,
      " 0.4435": 2070,
      "999969 0.000000 0.000000": 2071,
      "3 198": 2072,
      "073\n": 2073,
      "0.4": 2074,
      "993\n": 2075,
      "0 0.93": 2076,
      " 0.223": 2077,
      "245\n": 2078,
      "949\n": 2079,
      " 0.399": 2080,
      "982\n": 2081,
      "868\n": 2082,
      "517\n": 2083,
      " 213": 2084,
      "03 0.7": 2085,
      "950\n": 2086,
      " 0.307": 2087,
      " 0.000000 0.707": 2088,
      "042\n": 2089,
      "858\n": 2090,
      " 0.377": 2091,
      " 0.406": 2092,
      "9 0.94": 2093,
      "0 -0.03": 2094,
      "2 1.000000 0.000000 0.000000": 2095,
      "2 0.87": 2096,
      " 0.522": 2097,
      " 0.586": 2098,
      "77 0.0": 2099,
      " 0.213": 2100,
      " 0.357": 2101,
      "5 -0.7": 2102,
      " 0.405": 2103,
      " 0.697": 2104,
      "63 0.0": 2105,
      "292\n": 2106,
      "11 0.0": 2107,
      "0.08": 2108,
      "041\n": 2109,
      " 0.385": 2110,
      " 0.784": 2111,
      " 0.764": 2112,
      "75 0.0": 2113,
      "6 -0.3": 2114,
      " 0.236": 2115,
      " 216": 2116,
      "0916": 2117,
      "-0.000003 0.1": 2118,
      "0580": 2119,
      "092\n": 2120,
      "0.13": 2121,
      " 0.491": 2122,
      " 0.447": 2123,
      "640\n": 2124,
      " 0.885": 2125,
      " 0.274": 2126,
      "016\n": 2127,
      "224\n": 2128,
      " 0.275": 2129,
      "814\n": 2130,
      "065\n": 2131,
      " 0.565": 2132,
      "3 158": 2133,
      "222\n": 2134,
      " 0.000000 0.86": 2135,
      " 0.494": 2136,
      " 0.435": 2137,
      " 0.884": 2138,
      "0 0.03": 2139,
      "3 223": 2140,
      " 0.256": 2141,
      "057\n": 2142,
      " 0.571": 2143,
      " 0.725": 2144,
      "2024": 2145,
      "3 -0.04": 2146,
      " 0.993": 2147,
      "990\n": 2148,
      "217\n": 2149,
      " 0.404": 2150,
      " 0.563": 2151,
      "250\n": 2152,
      "270\n": 2153,
      "3 29": 2154,
      "231\n": 2155,
      "263\n": 2156,
      "968\n": 2157,
      " 0.883": 2158,
      "9 0.87": 2159,
      "0 0.26": 2160,
      " 0.963": 2161,
      "3 168": 2162,
      "840\n": 2163,
      "942\n": 2164,
      "943\n": 2165,
      " 0.621": 2166,
      "-0.0111": 2167,
      "280\n": 2168,
      "0 0.95": 2169,
      "5 -0.3": 2170,
      "971\n": 2171,
      " 0.771": 2172,
      " 0.887": 2173,
      "997\n": 2174,
      "215\n": 2175,
      " 0.556": 2176,
      "17 0.0": 2177,
      "937\n": 2178,
      "5 23": 2179,
      "0 -0.04": 2180,
      "2 -0.03": 2181,
      "2 0.94": 2182,
      "3 89": 2183,
      "645\n": 2184,
      " 0.685": 2185,
      "929\n": 2186,
      "213\n": 2187,
      "879\n": 2188,
      " 0.455": 2189,
      "518\n": 2190,
      "0.23": 2191,
      "230\n": 2192,
      " 0.551": 2193,
      "208\n": 2194,
      " 223": 2195,
      "273\n": 2196,
      " 0.347": 2197,
      "2 0.67": 2198,
      "0 0.94": 2199,
      " 0.000000 1.000000 0.000000 0.4": 2200,
      "219\n": 2201,
      "872\n": 2202,
      "813\n": 2203,
      "850\n": 2204,
      "958\n": 2205,
      " 0.407": 2206,
      "9 -0.07": 2207,
      " 0.271": 2208,
      " 0.967": 2209,
      "3 92": 2210,
      "2241": 2211,
      "243\n": 2212,
      " 0.503": 2213,
      " 0.587": 2214,
      "651\n": 2215,
      " 0.411": 2216,
      " 0.523": 2217,
      " 0.681": 2218,
      " 0.637": 2219,
      " 0.891": 2220,
      "935\n": 2221,
      " 0.724": 2222,
      "3 213": 2223,
      "265\n": 2224,
      "066\n": 2225,
      "933\n": 2226,
      " 0.794": 2227,
      "9 24": 2228,
      "4 -0.3": 2229,
      "249\n": 2230,
      "832\n": 2231,
      " 0.344": 2232,
      "864\n": 2233,
      "061\n": 2234,
      "0.0107": 2235,
      "262\n": 2236,
      "857\n": 2237,
      "848\n": 2238,
      " 0.364": 2239,
      "994\n": 2240,
      " 0.396": 2241,
      " 0.483": 2242,
      "0.0127": 2243,
      " 0.881": 2244,
      "0 0.27": 2245,
      "267\n": 2246,
      "869\n": 2247,
      "854\n": 2248,
      "849\n": 2249,
      " 0.376": 2250,
      "316\n": 2251,
      "902\n": 2252,
      "4 23": 2253,
      "922\n": 2254,
      " 0.000000 -0.00": 2255,
      "252\n": 2256,
      "253\n": 2257,
      "256\n": 2258,
      "0488": 2259,
      "617\n": 2260,
      " 0.806": 2261,
      "68 0.0": 2262,
      " 0.961": 2263,
      " 0.791": 2264,
      "9 0.61": 2265,
      "7 -0.3": 2266,
      "4 -0.7": 2267,
      " 0.937": 2268,
      "9847": 2269,
      " 0.705": 2270,
      "-0.0105": 2271,
      " 0.864": 2272,
      "2237": 2273,
      "211\n": 2274,
      "047\n": 2275,
      "310\n": 2276,
      "853\n": 2277,
      " 0.305": 2278,
      " 0.495": 2279,
      " 0.757": 2280,
      " 0.955": 2281,
      "039\n": 2282,
      "244\n": 2283,
      "5 -0.4": 2284,
      "3 102": 2285,
      "3 178": 2286,
      "952\n": 2287,
      "7 -0.5": 2288,
      "221\n": 2289,
      "818\n": 2290,
      "9 0.84": 2291,
      "2 20": 2292,
      "0 0.96": 2293,
      "043\n": 2294,
      "973\n": 2295,
      "918\n": 2296,
      "923\n": 2297,
      "216\n": 2298,
      "276\n": 2299,
      "967\n": 2300,
      " 0.321": 2301,
      "572\n": 2302,
      "0.0086": 2303,
      "268\n": 2304,
      "963\n": 2305,
      "919\n": 2306,
      " 0.526": 2307,
      "314\n": 2308,
      "0.0137": 2309,
      "239\n": 2310,
      "069\n": 2311,
      "063\n": 2312,
      " 0.457": 2313,
      "643\n": 2314,
      "418": 2315,
      " 0.694": 2316,
      " 0.425": 2317,
      "9 0.000000 0.000000 -1.000000": 2318,
      "032\n": 2319,
      "003\n": 2320,
      " 0.545": 2321,
      "6 23": 2322,
      "7 -0.4": 2323,
      " 0.000000 0.000000 1.000000 0.7": 2324,
      "995\n": 2325,
      "012\n": 2326,
      "851\n": 2327,
      "915\n": 2328,
      "656\n": 2329,
      "3 -0.06": 2330,
      " 0.896": 2331,
      "931\n": 2332,
      "9 -0.05": 2333,
      "843\n": 2334,
      " 0.427": 2335,
      " 0.601": 2336,
      " -0.025": 2337,
      "002\n": 2338,
      "035\n": 2339,
      " 0.417": 2340,
      "611\n": 2341,
      "888\n": 2342,
      " 0.988": 2343,
      "906\n": 2344,
      " 0.426": 2345,
      " 0.481": 2346,
      "333\n": 2347,
      "1 -0.3": 2348,
      "0855": 2349,
      "0122": 2350,
      "269\n": 2351,
      "852\n": 2352,
      " 0.395": 2353,
      " 0.351": 2354,
      " 0.445": 2355,
      "0 20": 2356,
      "58 0.0": 2357,
      "7 23": 2358,
      "352\n": 2359,
      "264\n": 2360,
      "812\n": 2361,
      "16 0.0": 2362,
      "0 0.86": 2363,
      "2422": 2364,
      "044\n": 2365,
      "830\n": 2366,
      "932\n": 2367,
      " 0.517": 2368,
      "909\n": 2369,
      "76 0.0": 2370,
      " 0.255": 2371,
      "0.000006": 2372,
      " 0.439825\n": 2373,
      " 0.443506\n": 2374,
      "009\n": 2375,
      "9786": 2376,
      " 0.424": 2377,
